nickfox-taterli/openocd/contrib/loaders/flash/imxrt_firert_stub/third_party/drivers/Source/fsl_csi.c
    CSI_Start(base);

    return kStatus_Success;
}

/*!
 * brief Stop the transfer using transactional functions.
 *
 * The driver does not clean the full frame buffers in queue. In other words, after
 * calling this function, user still could get the full frame buffers in queue
 * using function ref CSI_TransferGetFullBuffer.
 *
 * param base CSI peripheral base address.
 * param handle Pointer to the handle structure.
 *
 * retval kStatus_Success Stoped successfully.
 */
status_t CSI_TransferStop(CSI_Type *base, csi_handle_t *handle)
{
    assert(NULL != handle);
    uint8_t activeBufferNum;
    uint8_t bufIdx;

    CSI_Stop(base);
    CSI_DisableInterrupts(
        base, (uint32_t)kCSI_RxBuffer1DmaDoneInterruptEnable | (uint32_t)kCSI_RxBuffer0DmaDoneInterruptEnable);

    activeBufferNum = handle->activeBufferNum;

    handle->transferStarted = false;
    handle->activeBufferNum = 0;

    /*
     * Put active buffers to empty queue.
     *
     * If there is only one active frame buffers, then FB0 and FB1 use the same address,
     * put FB0 to empty buffer queue is OK.
     */
    for (bufIdx = 0; bufIdx < activeBufferNum; bufIdx++)
    {
        CSI_EnqueueBuffer(&handle->emptyBufferQueue, CSI_GetRxBufferAddr(base, bufIdx));
    }

    return kStatus_Success;
}

/*!
 * brief Submit empty frame buffer to queue.
 *
 * This function could be called before ref CSI_TransferStart or after ref
 * CSI_TransferStart. If there is no room in queue to store the empty frame
 * buffer, this function returns error.
 *
 * param base CSI peripheral base address.
 * param handle Pointer to the handle structure.
 * param frameBuffer Empty frame buffer to submit.
 *
 * retval kStatus_Success Submitted successfully.
 * retval kStatus_CSI_QueueFull Could not submit because there is no room in queue.
 */
status_t CSI_TransferSubmitEmptyBuffer(CSI_Type *base, csi_handle_t *handle, uint32_t frameBuffer)
{
    uint32_t csicr1;
    status_t status = kStatus_Success;

    /* Disable the interrupt to protect the index information in handle. */
    csicr1 = CSI_REG_CR1(base);

    CSI_REG_CR1(base) = (csicr1 & ~(CSI_CR1_FB2_DMA_DONE_INTEN_MASK | CSI_CR1_FB1_DMA_DONE_INTEN_MASK));

    if (handle->activeBufferNum == 1U)
    {
        /* Only 1 active framebuffer left, set the newly submitted buffer as active framebuffer */
        CSI_SetRxBufferAddr(base, handle->dmaDoneBufferIdx, frameBuffer);
        handle->activeBufferNum++;
    }
    else
    {
        status = CSI_EnqueueBuffer(&handle->emptyBufferQueue, frameBuffer);
    }

    CSI_REG_CR1(base) = csicr1;

    return status;
}

/*!
 * brief Get one full frame buffer from queue.
 *
 * After the transfer started using function ref CSI_TransferStart, the incoming
 * frames will be saved to the empty frame buffers in queue. This function gets
 * the full-filled frame buffer from the queue. If there is no full frame buffer
 * in queue, this function returns error.
 *
 * param base CSI peripheral base address.
 * param handle Pointer to the handle structure.
 * param frameBuffer Full frame buffer.
 *
 * retval kStatus_Success Got full framebuffer successfully.
 * retval kStatus_CSI_NoFullBuffer There is no full frame buffer in queue.
 */
status_t CSI_TransferGetFullBuffer(CSI_Type *base, csi_handle_t *handle, uint32_t *frameBuffer)
{
    uint32_t csicr1;
    status_t status = kStatus_Success;

    /* Disable the interrupt to protect the index information in handle. */
    csicr1 = CSI_REG_CR1(base);

    CSI_REG_CR1(base) = (csicr1 & ~(CSI_CR1_FB2_DMA_DONE_INTEN_MASK | CSI_CR1_FB1_DMA_DONE_INTEN_MASK));

    if (CSI_IsBufferQueueEmpty(&handle->fullBufferQueue))
    {
        frameBuffer = NULL;
        status = kStatus_CSI_NoFullBuffer;
    }
    else
    {
        *frameBuffer = CSI_DequeueBuffer(&handle->fullBufferQueue);
    }

    CSI_REG_CR1(base) = csicr1;

    return status;
}

/*!
 * brief CSI IRQ handle function.
 *
 * This function handles the CSI IRQ request to work with CSI driver transactional
 * APIs.
 *
 * param base CSI peripheral base address.
 * param handle CSI handle pointer.
 */
void CSI_TransferHandleIRQ(CSI_Type *base, csi_handle_t *handle)
{
    uint32_t csisr = CSI_REG_SR(base);
    uint32_t full_fb;
    uint32_t fb;
    bool isFullBufferEnqueued = true;

    /* Clear the error flags. */
    CSI_REG_SR(base) = csisr;

    if ((csisr & (CSI_SR_DMA_TSF_DONE_FB2_MASK | CSI_SR_DMA_TSF_DONE_FB1_MASK)) ==
        (CSI_SR_DMA_TSF_DONE_FB2_MASK | CSI_SR_DMA_TSF_DONE_FB1_MASK))
    {
        /* Both FB1 and FB2 flags assert, we don't know which framebuffer is done, so skip them. */
        ;
    }
    else if (0U != (csisr & (CSI_SR_DMA_TSF_DONE_FB2_MASK | CSI_SR_DMA_TSF_DONE_FB1_MASK)))
    {
        if (0U != (csisr & CSI_SR_DMA_TSF_DONE_FB2_MASK))
        {
            handle->dmaDoneBufferIdx = 1;
        }
        else
        {
            handle->dmaDoneBufferIdx = 0;
        }

        full_fb = CSI_GetRxBufferAddr(base, handle->dmaDoneBufferIdx);

        if (CSI_BufferQueueCount(&handle->emptyBufferQueue) > 0U)
        {
            if (CSI_IsBufferQueueFull(&handle->fullBufferQueue))
            {
                /* Drop the oldest buffer */
                CSI_DequeueBuffer(&handle->fullBufferQueue);//sw buffer que overflow?
            }
            CSI_EnqueueBuffer(&handle->fullBufferQueue, full_fb);

            /*
             * Get an empty buffer from the queue to use as an active
             * framebuffer to replace the full-filled framebuffer
             */
            fb = CSI_DequeueBuffer(&handle->emptyBufferQueue);
            CSI_SetRxBufferAddr(base, handle->dmaDoneBufferIdx, fb);
        }
        else if (handle->activeBufferNum > 1U)//==2
        {
            if (CSI_IsBufferQueueFull(&handle->fullBufferQueue))
            {
                /* Drop the oldest buffer */
                CSI_DequeueBuffer(&handle->fullBufferQueue);
            }
            CSI_EnqueueBuffer(&handle->fullBufferQueue, full_fb);

            handle->activeBufferNum--;

